app/controllers/ebay_items_controller.rb

SELECT * FROM `ebay_items` WHERE (`ebay_items`.`id` = 1)
---
  def show
    @ebay_item = EbayItem.find(params[:id], :include => [{:release => [:label_entity, :format, :ebay_items]}, :pictures])

SELECT * FROM `ebay_items` ORDER BY id DESC LIMIT 20
---
  def set_page_results(scope)
    ebay_items = EbayItem.send(scope).send(@time).paginate(:order => @order_query, :page => @page_num, :per_page => '20')