app/controllers/records_controller.rb

  def index
    @records = Record.all
---
SELECT * FROM `records`

  def show
    @record = Record.find(params[:id])
---
SELECT * FROM `records` WHERE (`records`.`id` = 1)

  def edit
    @record = Record.find(params[:id])
---
SELECT * FROM `records` WHERE (`records`.`id` = 2)

  def create
    @record = Record.new(params[:record])

    respond_to do |format|
      if @record.save
---
INSERT INTO `records` (`name`, `artist`, `studio`, `updated_at`, `date`, `band`, `engineer`, `description`, `producer`, `img_src`, `created_at`) VALUES('Lambsbread Collie', 'Welton Irie', 'Channel One', '2009-05-29 07:28:28', '2004-02-12', 'revolutionaries', 'Price Jammy', 'Roots Classic', 'Linval Thompson', 'http://testimage.com/', '2009-05-29 07:28:28')

  def update
    @record = Record.find(params[:id])

    respond_to do |format|
      if @record.update_attributes(params[:record])
---
SELECT * FROM `records` WHERE (`records`.`id` = 2)
UPDATE `records` SET `band` = 'The Arabs', `img_src` = 'jolly brothers - consciousness', `producer` = 'Prince Far I', `studio` = 'Harry J (Kingston, JA) & Treasure Isle (Kingston, JA)', `artist` = 'Prince Far I', `updated_at` = '2009-05-14 02:36:19', `engineer` = 'Sylvan Morris & Errol Brown', `name` = 'Free From Sin' WHERE `id` = 1

  def destroy
    @record = Record.find(params[:id])
    @record.destroy
---
SELECT * FROM `records` WHERE (`records`.`id` = 953125641)
DELETE FROM `records` WHERE `id` = 953125641