app/controllers/search_controller.rb

SELECT * FROM `ebay_items` WHERE (itemid like '%lee%' OR description like '%lee%' OR url like '%lee%' OR galleryimg like '%lee%' OR sellerid like '%lee%' OR itemid like '%perry%' OR description like '%perry%' OR url like '%perry%' OR galleryimg like '%perry%' OR sellerid like '%perry%') ORDER BY id DESC
---
  def search
    page_num = ParamsParser.parse_page_param(params)
    @query = ParamsParser.parse_query_param(params)
    @sort_param, @order_param = ParamsParser.parse_sort_params(params)
    include_mapped = params[:include_mapped].blank? ? true : params[:include_mapped] == "true"
    @ebay_items, @prev, @next, @start, @end, @total = EbayItem.search(:query => @query, :column => @sort_param,
                                                                      :order => @order_param, :page => page_num,
                                                                      :include_mapped => include_mapped)